---
kind: method
id: M:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.Dispose
source: html/cb9d491e-3b4f-a756-c595-587edc7936e4.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.Dispose Method

Releases all resources used by the ClosestPointsPairBetweenTwoCurves

## Syntax (C#)
```csharp
public void Dispose()
```